{"id": "17912916", "isbn13": "9781449361327", "title": "Data Science for Business: What You Need to Know about Data Mining and Data-Analytic Thinking", "authors": ["Foster Provost", "Tom Fawcett"], "publisher": null, "pub_date": "January 1, 2013", "language": "English", "categories": ["Programming", "Business", "Technology", "Technical", "Nonfiction"], "desc": "Written by renowned data science experts Foster Provost and Tom Fawcett, Data Science for Business introduces the fundamental principles of data science, and walks you through the \"data-analytic thinking\" necessary for extracting useful knowledge and business value from the data you collect. This guide also helps you understand the many data-mining techniques in use today. Based on an MBA course Provost has taught at New York University over the past ten years, Data Science for Business provides examples of real-world business problems to illustrate these principles. You’ll not only learn how to improve communication between business stakeholders and data scientists, but also how participate intelligently in your company’s data science projects. You’ll also discover how to think data-analytically, and fully appreciate how data science methods can support business decision-making.", "num_pages": 413, "format": "Paperback", "rating_value": 4.13, "rating_count": 2623, "url": "https://www.goodreads.com/book/show/17912916", "ingestion_date": "2025-11-19T11:22:30.223280"}
{"id": "17682206", "isbn13": "9781118661468", "title": "Data Smart: Using Data Science to Transform Information into Insight", "authors": ["John W. Foreman"], "publisher": null, "pub_date": "October 31, 2013", "language": "English", "categories": ["Programming", "Business", "Technical", "Nonfiction", "Computer Science"], "desc": "Data Science gets thrown around in the press like it's magic. Major retailers are predicting everything from when their customers are pregnant to when they want a new pair of Chuck Taylors. It's a brave new world where seemingly meaningless data can be transformed into valuable insight to drive smart business decisions.\nBut how does one exactly do data science? Do you have to hire one of these priests of the dark arts, the \"data scientist,\" to extract this gold from your data? Nope.\nData science is little more than using straight-forward steps to process raw data into actionable insight. And in Data Smart, author and data scientist John Foreman will show you how that's done within the familiar environment of a spreadsheet. \nWhy a spreadsheet? It's comfortable! You get to look at the data every step of the way, building confidence as you learn the tricks of the trade. Plus, spreadsheets are a vendor-neutral place to learn data science without the hype. \nBut don't let the Excel sheets fool you. This is a book for those serious about learning the analytic techniques, the math and the magic, behind big data.\nEach chapter will cover a different technique in a spreadsheet so you can follow along:\n - Mathematical optimization, including non-linear programming and genetic algorithms\n- Clustering via k-means, spherical k-means, and graph modularity\n- Data mining in graphs, such as outlier detection\n- Supervised AI through logistic regression, ensemble models, and bag-of-words models\n- Forecasting, seasonal adjustments, and prediction intervals through monte carlo simulation\n- Moving from spreadsheets into the R programming language\nYou get your hands dirty as you work alongside John through each technique. But never fear, the topics are readily applicable and the author laces humor throughout. You'll even learn what a dead squirrel has to do with optimization modeling, which you no doubt are dying to know.", "num_pages": 409, "format": "Paperback", "rating_value": 4.12, "rating_count": 1015, "url": "https://www.goodreads.com/book/show/17682206", "ingestion_date": "2025-11-19T11:22:34.122217"}
{"id": "25407018", "isbn13": null, "title": "Data Science from Scratch: First Principles with Python", "authors": ["Joel Grus"], "publisher": null, "pub_date": "April 14, 2015", "language": "English", "categories": ["Programming", "Technical", "Artificial Intelligence", "Nonfiction", "Reference"], "desc": "Data science libraries, frameworks, modules, and toolkits are great for doing data science, but they’re also a good way to dive into the discipline without actually understanding data science. In this book, you’ll learn how many of the most fundamental data science tools and algorithms work by implementing them \nfrom scratch\n.\nIf you have an aptitude for mathematics and some programming skills, author Joel Grus will help you get comfortable with the math and statistics at the core of data science, and with hacking skills you need to get started as a data scientist. Today’s messy glut of data holds answers to questions no one’s even thought to ask. This book provides you with the know-how to dig those answers out.\n \n   Get a crash course in Python \n   Learn the basics of linear algebra, statistics, and probability—and understand how and when they're used in data science \n   Collect, explore, clean, munge, and manipulate data \n   Dive into the fundamentals of machine learning \n   Implement models such as k-nearest Neighbors, Naive Bayes, linear and logistic regression, decision trees, neural networks, and clustering \n   Explore recommender systems, natural language processing, network analysis, MapReduce, and databases", "num_pages": 330, "format": "ebook", "rating_value": 3.91, "rating_count": 1135, "url": "https://www.goodreads.com/book/show/25407018", "ingestion_date": "2025-11-19T11:22:38.164719"}
{"id": "205905685", "isbn13": "9781647826314", "title": "Mindmasters: The Data-Driven Science of Predicting and Changing Human Behavior", "authors": ["Sandra Matz"], "publisher": null, "pub_date": "January 7, 2025", "language": "English", "categories": ["Business", "Sociology", "Artificial Intelligence", "Psychology", "Nonfiction"], "desc": "A refreshingly relatable exploration of how algorithms penetrate the most intimate aspects of our psychology, and how we can regain mastery over our lives—from the pioneering expert of psychological targeting.\nThere are more digital pieces of data than stars in the universe. This data helps us monitor our planet, decipher our genetic code, and take a deep dive into our psychology.\nAs algorithms become increasingly adept at accessing our minds, they also become more and more powerful at controlling it—enticing us to buy a certain product or vote for a certain political candidate. Some of us say this technological trend is no big deal. Others consider it one of the greatest threats to humanity. But what if the truth is more nuanced and mind-bending than that?\nIn Mindmasters, Columbia Business School professor Sandra Matz offers a fascinating insider perspective on the art and data-driven science of psychological targeting. By relating her own personal story of growing up in a small village—where few aspects of life remain truly private—to her groundbreaking research in computational psychology, Matz reveals how Big Data offers insights into the most intimate aspects of our psyche and how these insights empower external influence over the choices we make.\nFilled with Ted-Talk-like explanations and real-life examples from Matz's research and consulting work, Mindmasters paints a nuanced picture of the power of psychological targeting. Like nosy neighbors, it can be creepy, manipulative, and downright harmful—with scandals like Cambridge Analytica being merely the tip of the iceberg. Yet, like any tight-knit, supportive village community, it also holds enormous potential to help us live healthier and happier lives—for example, by improving our mental health, encouraging better financial decisions, or enabling us to break out of our echo chambers.\nWith passion and clear-eyed precision, Matz shows us how to manage psychological targeting and redesign the data game in a way that empowers us to take back control and ask more of our personal data.\nMindmasters is a riveting look at what our digital footprints reveal about us, how they're being used—for good and for ill—and how we can gain more control and power over the data that define us.", "num_pages": 240, "format": "Hardcover", "rating_value": 4.04, "rating_count": 289, "url": "https://www.goodreads.com/book/show/205905685", "ingestion_date": "2025-11-19T11:22:41.182896"}
{"id": "33399049", "isbn13": "9781491910351", "title": "R for Data Science: Import, Tidy, Transform, Visualize, and Model Data", "authors": ["Hadley Wickham"], "publisher": null, "pub_date": "December 12, 2016", "language": null, "categories": ["Programming", "Textbooks", "Technical", "Nonfiction", "Reference"], "desc": "Learn how to use R to turn raw data into insight, knowledge, and understanding. This book introduces you to R, RStudio, and the tidyverse, a collection of R packages designed to work together to make data science fast, fluent, and fun. Suitable for readers with no previous programming experience, R for Data Science is designed to get you doing data science as quickly as possible.\nAuthors Hadley Wickham and Garrett Grolemund guide you through the steps of importing, wrangling, exploring, and modeling your data and communicating the results. You'll get a complete, big-picture understanding of the data science cycle, along with basic tools you need to manage the details. Each section of the book is paired with exercises to help you practice what you've learned along the way.\nYou'll learn how \nWrangle\n—transform your datasets into a form convenient for analysis\nProgram\n—learn powerful R tools for solving data problems with greater clarity and ease\nExplore\n—examine your data, generate hypotheses, and quickly test them\nModel\n—provide a low-dimensional summary that captures true \"signals\" in your dataset\nCommunicate\n—learn R Markdown for integrating prose, code, and results", "num_pages": 521, "format": "Kindle Edition", "rating_value": 4.54, "rating_count": 1209, "url": "https://www.goodreads.com/book/show/33399049", "ingestion_date": "2025-11-19T11:22:44.442872"}
